*** crates/attractor-pipeline/src/graph.rs:259:9: replace PipelineGraph::node_in_cycle -> bool with true

*** mutation diff:
--- crates/attractor-pipeline/src/graph.rs
+++ replace PipelineGraph::node_in_cycle -> bool with true
@@ -251,30 +251,17 @@
             None => &[],
         }
     }
 
     /// Whether `start` participates in a directed cycle — i.e. some path of
     /// outgoing edges leads back to `start`. Used to keep loop-resident routing
     /// nodes from being response-cached (a cached label would pin the loop).
     pub fn node_in_cycle(&self, start: &str) -> bool {
-        use std::collections::HashSet;
-        let mut stack: Vec<&str> = vec![start];
-        let mut visited: HashSet<&str> = HashSet::new();
-        while let Some(id) = stack.pop() {
-            for edge in self.outgoing_edges(id) {
-                if edge.to == start {
-                    return true;
-                }
-                if visited.insert(&edge.to) {
-                    stack.push(&edge.to);
-                }
-            }
-        }
-        false
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn all_nodes(&self) -> impl Iterator<Item = &PipelineNode> {
         self.nodes.values()
     }
 
     pub fn all_nodes_mut(&mut self) -> impl Iterator<Item = &mut PipelineNode> {
         self.nodes.values_mut()

---- graph::tests::node_in_cycle_detects_loops stdout ----

thread 'graph::tests::node_in_cycle_detects_loops' (30363) panicked at crates/attractor-pipeline/src/graph.rs:448:9:
assertion failed: !pg.node_in_cycle("a")

---- handlers::codergen_handler::tests::is_cacheable_conditional_by_default stdout ----

thread 'handlers::codergen_handler::tests::is_cacheable_conditional_by_default' (30401) panicked at crates/attractor-pipeline/src/handlers/codergen_handler_tests.rs:314:5:
assertion failed: is_cacheable_node(&node, &graph)

---- handlers::codergen_handler::tests::is_cacheable_unrecognized_cache_value_falls_through_to_shape stdout ----

thread 'handlers::codergen_handler::tests::is_cacheable_unrecognized_cache_value_falls_through_to_shape' (30404) panicked at crates/attractor-pipeline/src/handlers/codergen_handler_tests.rs:609:5:
assertion failed: is_cacheable_node(&diamond, &graph)

failures:
    graph::tests::node_in_cycle_detects_loops
    handlers::codergen_handler::tests::codergen_cache_hit_skips_cli
    handlers::codergen_handler::tests::is_cacheable_conditional_by_default
    handlers::codergen_handler::tests::is_cacheable_unrecognized_cache_value_falls_through_to_shape

test result: FAILED. 188 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
