*** crates/attractor-pipeline/src/graph.rs:259:9: replace PipelineGraph::node_in_cycle -> bool with false

*** mutation diff:
--- crates/attractor-pipeline/src/graph.rs
+++ replace PipelineGraph::node_in_cycle -> bool with false
@@ -251,30 +251,17 @@
             None => &[],
         }
     }
 
     /// Whether `start` participates in a directed cycle — i.e. some path of
     /// outgoing edges leads back to `start`. Used to keep loop-resident routing
     /// nodes from being response-cached (a cached label would pin the loop).
     pub fn node_in_cycle(&self, start: &str) -> bool {
-        use std::collections::HashSet;
-        let mut stack: Vec<&str> = vec![start];
-        let mut visited: HashSet<&str> = HashSet::new();
-        while let Some(id) = stack.pop() {
-            for edge in self.outgoing_edges(id) {
-                if edge.to == start {
-                    return true;
-                }
-                if visited.insert(&edge.to) {
-                    stack.push(&edge.to);
-                }
-            }
-        }
-        false
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn all_nodes(&self) -> impl Iterator<Item = &PipelineNode> {
         self.nodes.values()
     }
 
     pub fn all_nodes_mut(&mut self) -> impl Iterator<Item = &mut PipelineNode> {
         self.nodes.values_mut()

---- graph::tests::node_in_cycle_detects_loops stdout ----

thread 'graph::tests::node_in_cycle_detects_loops' (31335) panicked at crates/attractor-pipeline/src/graph.rs:449:9:
assertion failed: pg.node_in_cycle("b")

---- handlers::codergen_handler::tests::is_cacheable_excludes_conditional_in_a_loop stdout ----

thread 'handlers::codergen_handler::tests::is_cacheable_excludes_conditional_in_a_loop' (31373) panicked at crates/attractor-pipeline/src/handlers/codergen_handler_tests.rs:356:5:
assertion failed: graph.node_in_cycle("check")

failures:
    graph::tests::node_in_cycle_detects_loops
    handlers::codergen_handler::tests::is_cacheable_excludes_conditional_in_a_loop

test result: FAILED. 190 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
