*** crates/attractor-pipeline/src/graph.rs:264:28: replace == with != in PipelineGraph::node_in_cycle

*** mutation diff:
--- crates/attractor-pipeline/src/graph.rs
+++ replace == with != in PipelineGraph::node_in_cycle
@@ -256,17 +256,17 @@
     /// outgoing edges leads back to `start`. Used to keep loop-resident routing
     /// nodes from being response-cached (a cached label would pin the loop).
     pub fn node_in_cycle(&self, start: &str) -> bool {
         use std::collections::HashSet;
         let mut stack: Vec<&str> = vec![start];
         let mut visited: HashSet<&str> = HashSet::new();
         while let Some(id) = stack.pop() {
             for edge in self.outgoing_edges(id) {
-                if edge.to == start {
+                if edge.to != /* ~ changed by cargo-mutants ~ */ start {
                     return true;
                 }
                 if visited.insert(&edge.to) {
                     stack.push(&edge.to);
                 }
             }
         }
         false

---- graph::tests::node_in_cycle_detects_loops stdout ----

thread 'graph::tests::node_in_cycle_detects_loops' (32308) panicked at crates/attractor-pipeline/src/graph.rs:461:9:
assertion failed: !pg.node_in_cycle("a")

failures:
    graph::tests::node_in_cycle_detects_loops

test result: FAILED. 191 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
