*** crates/attractor-pipeline/src/graph.rs:56:5: replace get_string_attr -> Option<String> with None

*** mutation diff:
--- crates/attractor-pipeline/src/graph.rs
+++ replace get_string_attr -> Option<String> with None
@@ -48,20 +48,17 @@
     pub fidelity: Option<String>,
     pub thread_id: Option<String>,
     pub loop_restart: bool,
 }
 
 // --- Attribute extraction helpers ---
 
 fn get_string_attr(attrs: &HashMap<String, AttributeValue>, key: &str) -> Option<String> {
-    attrs.get(key).and_then(|v| match v {
-        AttributeValue::String(s) => Some(s.clone()),
-        _ => None,
-    })
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn get_bool_attr(attrs: &HashMap<String, AttributeValue>, key: &str) -> Option<bool> {
     attrs.get(key).and_then(|v| match v {
         AttributeValue::Boolean(b) => Some(*b),
         AttributeValue::String(s) => Some(s == "true"),
         _ => None,
     })

---- edge_selection::tests::condition_false_skips_to_next_step stdout ----

thread 'edge_selection::tests::condition_false_skips_to_next_step' (26441) panicked at crates/attractor-pipeline/src/edge_selection.rs:229:9:
assertion `left == right` failed
  left: "B"
 right: "C"

---- engine::tests::branching_pipeline_routes_on_condition stdout ----

thread 'engine::tests::branching_pipeline_routes_on_condition' (26449) panicked at crates/attractor-pipeline/src/engine_tests.rs:104:5:
assertion failed: result.completed_nodes.contains(&"yes_path".to_string())

---- engine::tests::context_based_conditions_resolve_from_context stdout ----

thread 'engine::tests::context_based_conditions_resolve_from_context' (26451) panicked at crates/attractor-pipeline/src/engine_tests.rs:365:5:
Expected prod_path in completed nodes, got: ["start", "setup", "dev_path", "done"]

failures:
    edge_selection::tests::condition_false_skips_to_next_step
    engine::tests::branching_pipeline_routes_on_condition
    engine::tests::context_based_conditions_resolve_from_context
    engine::tests::goal_gate_failure_with_retry_target_retries
    engine::tests::goal_gate_failure_without_retry_returns_error
    engine::tests::step_limit_aborts_pipeline
    goal_gate::tests::failed_goal_gate_with_retry_target
    goal_gate::tests::four_level_retry_fallback_chain
    graph::tests::edge_weight_and_condition
    graph::tests::exit_node_finds_msquare
    graph::tests::from_dot_simple_linear_pipeline
    graph::tests::goal_extracted_from_graph_attrs

test result: FAILED. 164 passed; 28 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
