*** crates/attractor-pipeline/src/graph.rs:56:5: replace get_string_attr -> Option<String> with Some(String::new())

*** mutation diff:
--- crates/attractor-pipeline/src/graph.rs
+++ replace get_string_attr -> Option<String> with Some(String::new())
@@ -48,20 +48,17 @@
     pub fidelity: Option<String>,
     pub thread_id: Option<String>,
     pub loop_restart: bool,
 }
 
 // --- Attribute extraction helpers ---
 
 fn get_string_attr(attrs: &HashMap<String, AttributeValue>, key: &str) -> Option<String> {
-    attrs.get(key).and_then(|v| match v {
-        AttributeValue::String(s) => Some(s.clone()),
-        _ => None,
-    })
+    Some(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn get_bool_attr(attrs: &HashMap<String, AttributeValue>, key: &str) -> Option<bool> {
     attrs.get(key).and_then(|v| match v {
         AttributeValue::Boolean(b) => Some(*b),
         AttributeValue::String(s) => Some(s == "true"),
         _ => None,
     })

---- edge_selection::tests::condition_false_skips_to_next_step stdout ----

thread 'edge_selection::tests::condition_false_skips_to_next_step' (27413) panicked at crates/attractor-pipeline/src/edge_selection.rs:229:9:
assertion `left == right` failed
  left: "B"
 right: "C"

---- edge_selection::tests::step3_suggested_next_id stdout ----

thread 'edge_selection::tests::step3_suggested_next_id' (27418) panicked at crates/attractor-pipeline/src/edge_selection.rs:170:9:
assertion `left == right` failed
  left: "B"
 right: "C"

---- engine::tests::branching_pipeline_routes_on_condition stdout ----

thread 'engine::tests::branching_pipeline_routes_on_condition' (27421) panicked at crates/attractor-pipeline/src/engine_tests.rs:102:45:
called `Result::unwrap()` on an `Err` value: HandlerError { handler: "", node: "start", message: "No handler registered for type ''" }

failures:
    edge_selection::tests::condition_false_skips_to_next_step
    edge_selection::tests::step3_suggested_next_id
    engine::tests::branching_pipeline_routes_on_condition
    engine::tests::budget_limit_aborts_pipeline
    engine::tests::context_based_conditions_resolve_from_context
    engine::tests::context_updates_propagate
    engine::tests::goal_gate_failure_with_retry_loops_back
    engine::tests::goal_gate_failure_with_retry_target_retries
    engine::tests::goal_gate_failure_without_retry_returns_error
    engine::tests::linear_pipeline_completes
    engine::tests::step_limit_aborts_pipeline
    goal_gate::tests::failed_goal_gate_with_retry_target

test result: FAILED. 155 passed; 37 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
