*** crates/attractor-pipeline/src/graph.rs:56:5: replace get_string_attr -> Option<String> with Some("xyzzy".into())

*** mutation diff:
--- crates/attractor-pipeline/src/graph.rs
+++ replace get_string_attr -> Option<String> with Some("xyzzy".into())
@@ -48,20 +48,17 @@
     pub fidelity: Option<String>,
     pub thread_id: Option<String>,
     pub loop_restart: bool,
 }
 
 // --- Attribute extraction helpers ---
 
 fn get_string_attr(attrs: &HashMap<String, AttributeValue>, key: &str) -> Option<String> {
-    attrs.get(key).and_then(|v| match v {
-        AttributeValue::String(s) => Some(s.clone()),
-        _ => None,
-    })
+    Some("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn get_bool_attr(attrs: &HashMap<String, AttributeValue>, key: &str) -> Option<bool> {
     attrs.get(key).and_then(|v| match v {
         AttributeValue::Boolean(b) => Some(*b),
         AttributeValue::String(s) => Some(s == "true"),
         _ => None,
     })

---- edge_selection::tests::condition_false_skips_to_next_step stdout ----

thread 'edge_selection::tests::condition_false_skips_to_next_step' (28385) panicked at crates/attractor-pipeline/src/edge_selection.rs:229:9:
assertion `left == right` failed
  left: "B"
 right: "C"

---- edge_selection::tests::step4_highest_weight_wins stdout ----

thread 'edge_selection::tests::step4_highest_weight_wins' (28391) panicked at crates/attractor-pipeline/src/edge_selection.rs:185:9:
assertion `left == right` failed
  left: "B"
 right: "C"

---- edge_selection::tests::step5_lexical_tiebreak stdout ----

thread 'edge_selection::tests::step5_lexical_tiebreak' (28392) panicked at crates/attractor-pipeline/src/edge_selection.rs:200:9:
assertion `left == right` failed
  left: "C"
 right: "B"

failures:
    edge_selection::tests::condition_false_skips_to_next_step
    edge_selection::tests::step4_highest_weight_wins
    edge_selection::tests::step5_lexical_tiebreak
    engine::tests::branching_pipeline_routes_on_condition
    engine::tests::budget_limit_aborts_pipeline
    engine::tests::context_based_conditions_resolve_from_context
    engine::tests::context_updates_propagate
    engine::tests::goal_gate_failure_with_retry_loops_back
    engine::tests::goal_gate_failure_with_retry_target_retries
    engine::tests::goal_gate_failure_without_retry_returns_error
    engine::tests::linear_pipeline_completes
    engine::tests::step_limit_aborts_pipeline

test result: FAILED. 153 passed; 39 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
