*** crates/attractor-pipeline/src/handlers/codergen_handler.rs:359:8: delete ! in assemble_prompt

*** mutation diff:
--- crates/attractor-pipeline/src/handlers/codergen_handler.rs
+++ delete ! in assemble_prompt
@@ -351,17 +351,17 @@
 fn assemble_prompt(
     node: &PipelineNode,
     graph: &PipelineGraph,
     snapshot: &HashMap<String, serde_json::Value>,
 ) -> String {
     let prompt = node.prompt.as_deref().unwrap_or("No prompt specified");
     let mut full_prompt = String::new();
 
-    if !graph.goal.is_empty() {
+    if  /* ~ changed by cargo-mutants ~ */graph.goal.is_empty() {
         full_prompt.push_str(&format!("Pipeline goal: {}\n\n", graph.goal));
     }
 
     let mut context_keys: Vec<_> = snapshot
         .iter()
         .filter(|(k, _)| k.ends_with(".result") || k.ends_with(".output"))
         .collect();
     context_keys.sort_by(|a, b| a.0.cmp(b.0));

---- handlers::codergen_handler::tests::assemble_prompt_includes_goal_only_when_present stdout ----

thread 'handlers::codergen_handler::tests::assemble_prompt_includes_goal_only_when_present' (2812) panicked at crates/attractor-pipeline/src/handlers/codergen_handler_tests.rs:619:5:
assertion failed: p.contains("Pipeline goal: Ship it")

failures:
    handlers::codergen_handler::tests::assemble_prompt_includes_goal_only_when_present

test result: FAILED. 191 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
