*** crates/attractor-pipeline/src/handlers/codergen_handler.rs:368:8: delete ! in assemble_prompt

*** mutation diff:
--- crates/attractor-pipeline/src/handlers/codergen_handler.rs
+++ delete ! in assemble_prompt
@@ -360,17 +360,17 @@
         full_prompt.push_str(&format!("Pipeline goal: {}\n\n", graph.goal));
     }
 
     let mut context_keys: Vec<_> = snapshot
         .iter()
         .filter(|(k, _)| k.ends_with(".result") || k.ends_with(".output"))
         .collect();
     context_keys.sort_by(|a, b| a.0.cmp(b.0));
-    if !context_keys.is_empty() {
+    if  /* ~ changed by cargo-mutants ~ */context_keys.is_empty() {
         full_prompt.push_str("Context from prior pipeline steps:\n");
         for (k, v) in &context_keys {
             if let serde_json::Value::String(s) = v {
                 full_prompt.push_str(&format!("- {}: {}\n", k, s));
             } else {
                 full_prompt.push_str(&format!("- {}: {}\n", k, v));
             }
         }

---- handlers::codergen_handler::tests::assemble_prompt_is_deterministic_and_contains_task stdout ----

thread 'handlers::codergen_handler::tests::assemble_prompt_is_deterministic_and_contains_task' (4757) panicked at crates/attractor-pipeline/src/handlers/codergen_handler_tests.rs:380:5:
assertion failed: p1.contains("a.result")

failures:
    handlers::codergen_handler::tests::assemble_prompt_is_deterministic_and_contains_task

test result: FAILED. 191 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
