*** crates/attractor-pipeline/src/handlers/codergen_handler.rs:382:19: replace == with != in assemble_prompt

*** mutation diff:
--- crates/attractor-pipeline/src/handlers/codergen_handler.rs
+++ replace == with != in assemble_prompt
@@ -374,17 +374,17 @@
                 full_prompt.push_str(&format!("- {}: {}\n", k, v));
             }
         }
         full_prompt.push('\n');
     }
 
     full_prompt.push_str(&format!("Task ({}): {}", node.label, prompt));
 
-    if node.shape == "diamond" || node.node_type.as_deref() == Some("conditional") {
+    if node.shape != /* ~ changed by cargo-mutants ~ */ "diamond" || node.node_type.as_deref() == Some("conditional") {
         let edges = graph.outgoing_edges(&node.id);
         let labels: Vec<_> = edges.iter().filter_map(|e| e.label.as_deref()).collect();
         if !labels.is_empty() {
             full_prompt.push_str(&format!(
                 "\n\nYou MUST end your response with exactly one of these labels on its own line: {}",
                 labels.join(", ")
             ));
         }

---- handlers::codergen_handler::tests::assemble_prompt_adds_label_instruction_only_for_labeled_conditional stdout ----

thread 'handlers::codergen_handler::tests::assemble_prompt_adds_label_instruction_only_for_labeled_conditional' (6703) panicked at crates/attractor-pipeline/src/handlers/codergen_handler_tests.rs:640:5:
assertion failed: p.contains("You MUST end your response with exactly one of these labels")

failures:
    handlers::codergen_handler::tests::assemble_prompt_adds_label_instruction_only_for_labeled_conditional

test result: FAILED. 191 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
