*** crates/attractor-pipeline/src/handlers/codergen_handler.rs:409:5: replace is_cacheable_node -> bool with false

*** mutation diff:
--- crates/attractor-pipeline/src/handlers/codergen_handler.rs
+++ replace is_cacheable_node -> bool with false
@@ -401,25 +401,17 @@
 ///
 /// Conditional/routing nodes are cacheable by default because their output is a
 /// single label consumed by edge selection, with nothing to replay — **except**
 /// when the node sits in a directed cycle. A cached routing label would pin a
 /// retry/fix loop forever (a live, non-deterministic run eventually routes out;
 /// a cached one cannot), forcing a `max_steps` abort. Loop-resident routing must
 /// re-evaluate live, so those nodes are not cached unless explicitly `cache="ro"`.
 fn is_cacheable_node(node: &PipelineNode, graph: &PipelineGraph) -> bool {
-    match node.raw_attrs.get("cache") {
-        Some(AttributeValue::String(s)) if s.eq_ignore_ascii_case("off") => return false,
-        Some(AttributeValue::String(s)) if s.eq_ignore_ascii_case("ro") => return true,
-        Some(AttributeValue::Boolean(false)) => return false,
-        _ => {}
-    }
-    let is_conditional =
-        node.shape == "diamond" || node.node_type.as_deref() == Some("conditional");
-    is_conditional && !graph.node_in_cycle(&node.id)
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn string_attr<'a>(node: &'a PipelineNode, key: &str) -> Option<&'a str> {
     match node.raw_attrs.get(key) {
         Some(AttributeValue::String(s)) => Some(s.as_str()),
         _ => None,
     }
 }

---- handlers::codergen_handler::tests::is_cacheable_conditional_by_default stdout ----

thread 'handlers::codergen_handler::tests::is_cacheable_conditional_by_default' (10611) panicked at crates/attractor-pipeline/src/handlers/codergen_handler_tests.rs:314:5:
assertion failed: is_cacheable_node(&node, &graph)

---- handlers::codergen_handler::tests::is_cacheable_respects_ro_and_off_attrs stdout ----

thread 'handlers::codergen_handler::tests::is_cacheable_respects_ro_and_off_attrs' (10613) panicked at crates/attractor-pipeline/src/handlers/codergen_handler_tests.rs:334:5:
assertion failed: is_cacheable_node(&node, &graph)

---- handlers::codergen_handler::tests::is_cacheable_excludes_conditional_in_a_loop stdout ----

thread 'handlers::codergen_handler::tests::is_cacheable_excludes_conditional_in_a_loop' (10612) panicked at crates/attractor-pipeline/src/handlers/codergen_handler_tests.rs:365:5:
assertion failed: is_cacheable_node(&ro_node, &graph)

failures:
    handlers::codergen_handler::tests::codergen_cache_hit_skips_cli
    handlers::codergen_handler::tests::is_cacheable_conditional_by_default
    handlers::codergen_handler::tests::is_cacheable_excludes_conditional_in_a_loop
    handlers::codergen_handler::tests::is_cacheable_respects_ro_and_off_attrs
    handlers::codergen_handler::tests::is_cacheable_unrecognized_cache_value_falls_through_to_shape

test result: FAILED. 187 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
