*** crates/attractor-pipeline/src/handlers/codergen_handler.rs:411:44: replace match guard s.eq_ignore_ascii_case("ro") with false in is_cacheable_node

*** mutation diff:
--- crates/attractor-pipeline/src/handlers/codergen_handler.rs
+++ replace match guard s.eq_ignore_ascii_case("ro") with false in is_cacheable_node
@@ -403,17 +403,17 @@
 /// single label consumed by edge selection, with nothing to replay — **except**
 /// when the node sits in a directed cycle. A cached routing label would pin a
 /// retry/fix loop forever (a live, non-deterministic run eventually routes out;
 /// a cached one cannot), forcing a `max_steps` abort. Loop-resident routing must
 /// re-evaluate live, so those nodes are not cached unless explicitly `cache="ro"`.
 fn is_cacheable_node(node: &PipelineNode, graph: &PipelineGraph) -> bool {
     match node.raw_attrs.get("cache") {
         Some(AttributeValue::String(s)) if s.eq_ignore_ascii_case("off") => return false,
-        Some(AttributeValue::String(s)) if s.eq_ignore_ascii_case("ro") => return true,
+        Some(AttributeValue::String(s)) if false /* ~ changed by cargo-mutants ~ */ => return true,
         Some(AttributeValue::Boolean(false)) => return false,
         _ => {}
     }
     let is_conditional =
         node.shape == "diamond" || node.node_type.as_deref() == Some("conditional");
     is_conditional && !graph.node_in_cycle(&node.id)
 }

---- handlers::codergen_handler::tests::is_cacheable_respects_ro_and_off_attrs stdout ----

thread 'handlers::codergen_handler::tests::is_cacheable_respects_ro_and_off_attrs' (15482) panicked at crates/attractor-pipeline/src/handlers/codergen_handler_tests.rs:334:5:
assertion failed: is_cacheable_node(&node, &graph)

---- handlers::codergen_handler::tests::is_cacheable_excludes_conditional_in_a_loop stdout ----

thread 'handlers::codergen_handler::tests::is_cacheable_excludes_conditional_in_a_loop' (15481) panicked at crates/attractor-pipeline/src/handlers/codergen_handler_tests.rs:365:5:
assertion failed: is_cacheable_node(&ro_node, &graph)

failures:
    handlers::codergen_handler::tests::is_cacheable_excludes_conditional_in_a_loop
    handlers::codergen_handler::tests::is_cacheable_respects_ro_and_off_attrs

test result: FAILED. 190 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
