*** crates/attractor-pipeline/src/handlers/codergen_handler.rs:412:9: delete match arm Some(AttributeValue::Boolean(false)) in is_cacheable_node

*** mutation diff:
--- crates/attractor-pipeline/src/handlers/codergen_handler.rs
+++ delete match arm Some(AttributeValue::Boolean(false)) in is_cacheable_node
@@ -404,17 +404,17 @@
 /// when the node sits in a directed cycle. A cached routing label would pin a
 /// retry/fix loop forever (a live, non-deterministic run eventually routes out;
 /// a cached one cannot), forcing a `max_steps` abort. Loop-resident routing must
 /// re-evaluate live, so those nodes are not cached unless explicitly `cache="ro"`.
 fn is_cacheable_node(node: &PipelineNode, graph: &PipelineGraph) -> bool {
     match node.raw_attrs.get("cache") {
         Some(AttributeValue::String(s)) if s.eq_ignore_ascii_case("off") => return false,
         Some(AttributeValue::String(s)) if s.eq_ignore_ascii_case("ro") => return true,
-        Some(AttributeValue::Boolean(false)) => return false,
+         /* ~ changed by cargo-mutants ~ */
         _ => {}
     }
     let is_conditional =
         node.shape == "diamond" || node.node_type.as_deref() == Some("conditional");
     is_conditional && !graph.node_in_cycle(&node.id)
 }
 
 fn string_attr<'a>(node: &'a PipelineNode, key: &str) -> Option<&'a str> {

---- handlers::codergen_handler::tests::is_cacheable_boolean_false_opts_out stdout ----

thread 'handlers::codergen_handler::tests::is_cacheable_boolean_false_opts_out' (11587) panicked at crates/attractor-pipeline/src/handlers/codergen_handler_tests.rs:596:5:
assertion failed: !is_cacheable_node(&node, &graph)

failures:
    handlers::codergen_handler::tests::is_cacheable_boolean_false_opts_out

test result: FAILED. 191 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
