*** crates/attractor-pipeline/src/handlers/codergen_handler.rs:416:62: replace == with != in is_cacheable_node

*** mutation diff:
--- crates/attractor-pipeline/src/handlers/codergen_handler.rs
+++ replace == with != in is_cacheable_node
@@ -408,17 +408,17 @@
 fn is_cacheable_node(node: &PipelineNode, graph: &PipelineGraph) -> bool {
     match node.raw_attrs.get("cache") {
         Some(AttributeValue::String(s)) if s.eq_ignore_ascii_case("off") => return false,
         Some(AttributeValue::String(s)) if s.eq_ignore_ascii_case("ro") => return true,
         Some(AttributeValue::Boolean(false)) => return false,
         _ => {}
     }
     let is_conditional =
-        node.shape == "diamond" || node.node_type.as_deref() == Some("conditional");
+        node.shape == "diamond" || node.node_type.as_deref() != /* ~ changed by cargo-mutants ~ */ Some("conditional");
     is_conditional && !graph.node_in_cycle(&node.id)
 }
 
 fn string_attr<'a>(node: &'a PipelineNode, key: &str) -> Option<&'a str> {
     match node.raw_attrs.get(key) {
         Some(AttributeValue::String(s)) => Some(s.as_str()),
         _ => None,
     }

---- handlers::codergen_handler::tests::is_cacheable_box_node_default_off stdout ----

thread 'handlers::codergen_handler::tests::is_cacheable_box_node_default_off' (18397) panicked at crates/attractor-pipeline/src/handlers/codergen_handler_tests.rs:324:5:
assertion failed: !is_cacheable_node(&node, &graph)

---- handlers::codergen_handler::tests::is_cacheable_conditional_by_default stdout ----

thread 'handlers::codergen_handler::tests::is_cacheable_conditional_by_default' (18398) panicked at crates/attractor-pipeline/src/handlers/codergen_handler_tests.rs:317:5:
assertion failed: is_cacheable_node(&node, &graph)

---- handlers::codergen_handler::tests::is_cacheable_unrecognized_cache_value_falls_through_to_shape stdout ----

thread 'handlers::codergen_handler::tests::is_cacheable_unrecognized_cache_value_falls_through_to_shape' (18401) panicked at crates/attractor-pipeline/src/handlers/codergen_handler_tests.rs:606:5:
assertion failed: !is_cacheable_node(&box_node, &graph)

failures:
    handlers::codergen_handler::tests::is_cacheable_box_node_default_off
    handlers::codergen_handler::tests::is_cacheable_conditional_by_default
    handlers::codergen_handler::tests::is_cacheable_unrecognized_cache_value_falls_through_to_shape

test result: FAILED. 189 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.17s

*** result: Failure(101)
