*** crates/attractor-pipeline/src/handlers/codergen_handler.rs:421:5: replace string_attr -> Option<&'a str> with None

*** mutation diff:
--- crates/attractor-pipeline/src/handlers/codergen_handler.rs
+++ replace string_attr -> Option<&'a str> with None
@@ -413,20 +413,17 @@
         _ => {}
     }
     let is_conditional =
         node.shape == "diamond" || node.node_type.as_deref() == Some("conditional");
     is_conditional && !graph.node_in_cycle(&node.id)
 }
 
 fn string_attr<'a>(node: &'a PipelineNode, key: &str) -> Option<&'a str> {
-    match node.raw_attrs.get(key) {
-        Some(AttributeValue::String(s)) => Some(s.as_str()),
-        _ => None,
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Derive the cache key from every deterministic input that feeds the CLI call.
 ///
 /// `workdir` must be the *effective* execution directory — the resolved current
 /// directory when the node has no explicit workdir — so results from different
 /// project trees can never collide (the CLI reads/writes files relative to it).
 fn build_cache_key(

---- handlers::codergen_handler::tests::build_cache_key_reflects_allowed_tools stdout ----

thread 'handlers::codergen_handler::tests::build_cache_key_reflects_allowed_tools' (21309) panicked at crates/attractor-pipeline/src/handlers/codergen_handler_tests.rs:575:5:
assertion `left != right` failed
  left: "532b1edb7e96663ecc47d8ffc8b2f6f420a98156f07857142a08d2820db5ba9c"
 right: "532b1edb7e96663ecc47d8ffc8b2f6f420a98156f07857142a08d2820db5ba9c"

---- handlers::codergen_handler::tests::string_attr_reads_present_and_absent stdout ----

thread 'handlers::codergen_handler::tests::string_attr_reads_present_and_absent' (21345) panicked at crates/attractor-pipeline/src/handlers/codergen_handler_tests.rs:557:5:
assertion `left == right` failed
  left: None
 right: Some("Read,Write")

failures:
    handlers::codergen_handler::tests::build_cache_key_reflects_allowed_tools
    handlers::codergen_handler::tests::string_attr_reads_present_and_absent

test result: FAILED. 190 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
