*** crates/attractor-pipeline/src/handlers/codergen_handler.rs:422:9: delete match arm Some(AttributeValue::String(s)) in string_attr

*** mutation diff:
--- crates/attractor-pipeline/src/handlers/codergen_handler.rs
+++ delete match arm Some(AttributeValue::String(s)) in string_attr
@@ -414,17 +414,17 @@
     }
     let is_conditional =
         node.shape == "diamond" || node.node_type.as_deref() == Some("conditional");
     is_conditional && !graph.node_in_cycle(&node.id)
 }
 
 fn string_attr<'a>(node: &'a PipelineNode, key: &str) -> Option<&'a str> {
     match node.raw_attrs.get(key) {
-        Some(AttributeValue::String(s)) => Some(s.as_str()),
+         /* ~ changed by cargo-mutants ~ */
         _ => None,
     }
 }
 
 /// Derive the cache key from every deterministic input that feeds the CLI call.
 ///
 /// `workdir` must be the *effective* execution directory — the resolved current
 /// directory when the node has no explicit workdir — so results from different

---- handlers::codergen_handler::tests::build_cache_key_reflects_allowed_tools stdout ----

thread 'handlers::codergen_handler::tests::build_cache_key_reflects_allowed_tools' (24232) panicked at crates/attractor-pipeline/src/handlers/codergen_handler_tests.rs:575:5:
assertion `left != right` failed
  left: "532b1edb7e96663ecc47d8ffc8b2f6f420a98156f07857142a08d2820db5ba9c"
 right: "532b1edb7e96663ecc47d8ffc8b2f6f420a98156f07857142a08d2820db5ba9c"

---- handlers::codergen_handler::tests::string_attr_reads_present_and_absent stdout ----

thread 'handlers::codergen_handler::tests::string_attr_reads_present_and_absent' (24268) panicked at crates/attractor-pipeline/src/handlers/codergen_handler_tests.rs:557:5:
assertion `left == right` failed
  left: None
 right: Some("Read,Write")

failures:
    handlers::codergen_handler::tests::build_cache_key_reflects_allowed_tools
    handlers::codergen_handler::tests::string_attr_reads_present_and_absent

test result: FAILED. 190 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
