*** crates/attractor-pipeline/src/handlers/codergen_handler.rs:452:5: replace effective_workdir -> String with "xyzzy".into()

*** mutation diff:
--- crates/attractor-pipeline/src/handlers/codergen_handler.rs
+++ replace effective_workdir -> String with "xyzzy".into()
@@ -444,21 +444,17 @@
         .field("workdir", workdir)
         .field("prompt", full_prompt)
         .finish()
 }
 
 /// The directory the CLI will actually run in: the node's explicit workdir, or
 /// the process current directory when unset (which the spawned CLI inherits).
 fn effective_workdir(workdir: Option<&str>) -> String {
-    workdir.map(str::to_string).unwrap_or_else(|| {
-        std::env::current_dir()
-            .map(|p| p.to_string_lossy().into_owned())
-            .unwrap_or_default()
-    })
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Build a [`Cache`](attractor_cache::Cache) from run-level settings carried in
 /// the pipeline context (`__cache_mode`, `__cache_dir`, `__cache_ttl_days`).
 async fn cache_from_context(context: &Context) -> attractor_cache::Cache {
     let mode = context
         .get("__cache_mode")
         .await

---- handlers::codergen_handler::tests::effective_workdir_uses_explicit_then_cwd stdout ----

thread 'handlers::codergen_handler::tests::effective_workdir_uses_explicit_then_cwd' (28131) panicked at crates/attractor-pipeline/src/handlers/codergen_handler_tests.rs:580:5:
assertion `left == right` failed
  left: "xyzzy"
 right: "/explicit/dir"

---- handlers::codergen_handler::tests::codergen_cache_hit_skips_cli stdout ----

thread 'handlers::codergen_handler::tests::codergen_cache_hit_skips_cli' (28129) panicked at crates/attractor-pipeline/src/handlers/codergen_handler_tests.rs:482:62:
called `Result::unwrap()` on an `Err` value: CommandTimeout { timeout_ms: 200 }

failures:
    handlers::codergen_handler::tests::codergen_cache_hit_skips_cli
    handlers::codergen_handler::tests::effective_workdir_uses_explicit_then_cwd

test result: FAILED. 190 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
