*** crates/attractor-pipeline/src/handlers/codergen_provider.rs:244:5: replace head -> &str with "xyzzy"

*** mutation diff:
--- crates/attractor-pipeline/src/handlers/codergen_provider.rs
+++ replace head -> &str with "xyzzy"
@@ -236,20 +236,17 @@
 // ---------------------------------------------------------------------------
 // CLI output parsers
 // ---------------------------------------------------------------------------
 
 /// Borrow the first `max` characters of `s`. Unlike byte slicing (`&s[..500]`),
 /// this never panics on a multi-byte UTF-8 boundary — CLI output is arbitrary
 /// text and may contain non-ASCII bytes exactly at the cutoff.
 fn head(s: &str, max: usize) -> &str {
-    match s.char_indices().nth(max) {
-        Some((idx, _)) => &s[..idx],
-        None => s,
-    }
+    "xyzzy" /* ~ changed by cargo-mutants ~ */
 }
 
 pub(super) fn parse_cli_output(
     provider: LlmCliProvider,
     stdout: &str,
     stderr: &str,
     node_id: &str,
 ) -> Result<NormalizedCliResult> {

---- handlers::codergen_handler::provider::head_tests::returns_whole_string_when_shorter_than_max stdout ----

thread 'handlers::codergen_handler::provider::head_tests::returns_whole_string_when_shorter_than_max' (2520) panicked at crates/attractor-pipeline/src/handlers/codergen_provider.rs:372:9:
assertion `left == right` failed
  left: "xyzzy"

---- handlers::codergen_handler::provider::head_tests::truncates_multibyte_without_panicking stdout ----

thread 'handlers::codergen_handler::provider::head_tests::truncates_multibyte_without_panicking' (2521) panicked at crates/attractor-pipeline/src/handlers/codergen_provider.rs:380:9:
assertion `left == right` failed
  left: 5
 right: 500

failures:
    handlers::codergen_handler::provider::head_tests::returns_whole_string_when_shorter_than_max
    handlers::codergen_handler::provider::head_tests::truncates_multibyte_without_panicking

test result: FAILED. 190 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
