*** crates/attractor-cli/src/main.rs:288:5: replace resolve_cache_mode -> attractor_cache::CacheMode with Default::default()

*** mutation diff:
--- crates/attractor-cli/src/main.rs
+++ replace resolve_cache_mode -> attractor_cache::CacheMode with Default::default()
@@ -280,26 +280,17 @@
 
 /// Resolve the cache mode from the CLI flags and the `PAS_CACHE` env var.
 /// Precedence: --no-cache > --refresh-cache > (--cache | PAS_CACHE=1) > off.
 fn resolve_cache_mode(
     cache: bool,
     no_cache: bool,
     refresh_cache: bool,
 ) -> attractor_cache::CacheMode {
-    use attractor_cache::CacheMode;
-    if no_cache {
-        CacheMode::Off
-    } else if refresh_cache {
-        CacheMode::Refresh
-    } else if cache || std::env::var("PAS_CACHE").as_deref() == Ok("1") {
-        CacheMode::ReadWrite
-    } else {
-        CacheMode::Off
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Subcommand)]
 enum TrustAction {
     /// Add a manifest to the trust store
     Add {
         /// Path to the pas.toml file
         path: PathBuf,

---- tests::cache_flag_enables_readwrite stdout ----

thread 'tests::cache_flag_enables_readwrite' (7811) panicked at crates/attractor-cli/src/main.rs:553:9:
assertion `left == right` failed
  left: Off
 right: ReadWrite

---- tests::default_is_off_and_env_enables stdout ----

thread 'tests::default_is_off_and_env_enables' (7812) panicked at crates/attractor-cli/src/main.rs:558:34:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

---- tests::no_cache_overrides_everything stdout ----

thread 'tests::no_cache_overrides_everything' (7813) panicked at crates/attractor-cli/src/main.rs:538:34:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

failures:
    tests::cache_flag_enables_readwrite
    tests::default_is_off_and_env_enables
    tests::no_cache_overrides_everything
    tests::refresh_beats_cache

test result: FAILED. 28 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
