*** crates/attractor-cli/src/main.rs:293:21: replace || with && in resolve_cache_mode

*** mutation diff:
--- crates/attractor-cli/src/main.rs
+++ replace || with && in resolve_cache_mode
@@ -285,17 +285,17 @@
     no_cache: bool,
     refresh_cache: bool,
 ) -> attractor_cache::CacheMode {
     use attractor_cache::CacheMode;
     if no_cache {
         CacheMode::Off
     } else if refresh_cache {
         CacheMode::Refresh
-    } else if cache || std::env::var("PAS_CACHE").as_deref() == Ok("1") {
+    } else if cache && /* ~ changed by cargo-mutants ~ */ std::env::var("PAS_CACHE").as_deref() == Ok("1") {
         CacheMode::ReadWrite
     } else {
         CacheMode::Off
     }
 }
 
 #[derive(Subcommand)]
 enum TrustAction {

---- tests::cache_flag_enables_readwrite stdout ----

thread 'tests::cache_flag_enables_readwrite' (8044) panicked at crates/attractor-cli/src/main.rs:562:9:
assertion `left == right` failed
  left: Off
 right: ReadWrite

---- tests::default_is_off_and_env_enables stdout ----

thread 'tests::default_is_off_and_env_enables' (8045) panicked at crates/attractor-cli/src/main.rs:567:34:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

---- tests::no_cache_overrides_everything stdout ----

thread 'tests::no_cache_overrides_everything' (8046) panicked at crates/attractor-cli/src/main.rs:547:34:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

failures:
    tests::cache_flag_enables_readwrite
    tests::default_is_off_and_env_enables
    tests::no_cache_overrides_everything
    tests::refresh_beats_cache

test result: FAILED. 28 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
